app/Controllers/Admin/Surat.php

SELECT *
FROM `surat`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $surats = $this->suratModel
            ->orderBy('created_at', 'DESC')
            ->findAll();