app/Controllers/Admin/SuratKeluar.php

    public function index()
    {
        $surats = $this->suratModel
            ->where('status', 'selesai')
            ->orderBy('updated_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `surat`
WHERE `status` = 'selesai'
ORDER BY `updated_at` DESC