app/Controllers/Login.php

    public function LoginProses()
    {
        $session = session();
        $userModel = new UserModel();

        $email = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        // Ambil user berdasarkan email
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@mail.com'
 LIMIT 1