app/Controllers/Mahasiswa.php

SELECT COUNT(*) AS `numrows`
FROM `simr`
WHERE `user_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `spm`
WHERE `user_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `sism`
WHERE `user_id` = '2'
---
    public function dashboard()
    {
        $userId = session()->get('user_id');

        $simrModel = new SimrModel();
        $spmModel  = new SpmModel();
        $sismModel = new SismModel();

        $data = [
            'title'      => 'Dashboard Mahasiswa',
            'totalSIMR'  => $simrModel->where('user_id', $userId)->countAllResults(),
            'totalSPM'   => $spmModel->where('user_id', $userId)->countAllResults(),
            'totalSISM'  => $sismModel->where('user_id', $userId)->countAllResults(),