app/Controllers/Mahasiswa.php

    public function dashboard()
{
    $userId = session()->get('user_id');
    $nim    = session()->get('nim');
    $suratModel = new SuratModel();
    $simrModel  = new SimrModel();
    $sikModel   = new SikModel();

    $data = [
        'title' => 'Dashboard Mahasiswa',

        // dari tabel surat
        'totalSPM' => $suratModel
            ->where('user_id', $userId)
            ->where('jenis_surat', 'SPM')
            ->countAllResults(),

        'totalSKAK' => $suratModel
            ->where('user_id', $userId)
            ->where('jenis_surat', 'SKAK')
            ->countAllResults(),

        'totalSISM' => $suratModel
            ->where('user_id', $userId)
            ->where('jenis_surat', 'SISM')
            ->countAllResults(),

        // dari tabel masing-masing
        'totalSIMR' => $simrModel
            ->where('user_id', $userId)
            ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `surat`
WHERE `user_id` = '14'
AND `jenis_surat` = 'SPM'
SELECT COUNT(*) AS `numrows`
FROM `surat`
WHERE `user_id` = '14'
AND `jenis_surat` = 'SKAK'
SELECT COUNT(*) AS `numrows`
FROM `surat`
WHERE `user_id` = '14'
AND `jenis_surat` = 'SISM'
SELECT COUNT(*) AS `numrows`
FROM `spm`
WHERE `user_id` = '14'
SELECT COUNT(*) AS `numrows`
FROM `sism`
WHERE `user_id` = '14'
SELECT COUNT(*) AS `numrows`
FROM `surat`
WHERE `user_id` = '14'
SELECT COUNT(*) AS `numrows`
FROM `simr`
WHERE `user_id` = '14'