app/Controllers/User.php

    public function index()
    {
        return view('admin/users/index', [
            'title' => 'Manajemen Users',
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `users`

    public function delete($id)
    {
        $this->userModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('6')