app/Controllers/Mahasiswa/Sik.php

    public function edit($id)
    {
        $sik = $this->sikModel->find($id);
---
SELECT *
FROM `sik`
WHERE `sik`.`id` = '2'