app/Controllers/Mahasiswa/Simr.php

    public function index()
    {
        $data = [
            'title' => 'Surat Izin Meminjam Ruangan',
            'surats' => $this->simrModel->findAll()
---
SELECT *
FROM `simr`