app/Controllers/Mahasiswa/Skak.php

    public function index()
    {
        return view('mahasiswa/skak/index', [
            'title'  => 'Data Surat Keterangan Aktif Kuliah',
            'surats' => $this->suratModel
                ->where('user_id', session()->get('user_id'))
                ->orderBy('created_at', 'DESC')
                ->findAll()
---
SELECT *
FROM `surat`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC

    public function store()
    {
        $dataSurat = [
            'nama_orangtua' => $this->request->getPost('nama_orangtua'),
            'pangkat'       => $this->request->getPost('pangkat'),
            'semester'      => $this->request->getPost('semester'),
            'tahun_ajaran'  => $this->request->getPost('tahun_ajaran'),
        ];

        $this->suratModel->insert([
            'user_id'     => session()->get('user_id'),
            'jenis_surat' => 'skak',
            'data_surat'  => json_encode($dataSurat),
            'status'      => 'pending'
        ]);
---
INSERT INTO `surat` (`user_id`, `jenis_surat`, `data_surat`, `status`, `created_at`, `updated_at`) VALUES ('2', 'skak', '{\"nama_orangtua\":\"ini haaman mhs1\",\"pangkat\":\"blabla\",\"semester\":\"Genap\",\"tahun_ajaran\":\"2024\\/2025\"}', 'pending', '2025-12-17 06:53:21', '2025-12-17 06:53:21')