app/Controllers/Mahasiswa/Spm.php

    public function index()
    {
        return view('mahasiswa/spm/index', [
            'title'  => 'Surat Permohonan Magang',
            'surats' => $this->spm->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `spm`
ORDER BY `id` DESC